content/posts/computation.md
+++
title = "computation"
author = ["Cameron Smith"]
lastmod = 2020-09-24T22:44:46-04:00
slug = "computation"
draft = false
+++

## concept {#concept}


### From [Joscha Bach]({{< relref "Joscha_Bach" >}}) {#from-joscha-bach--joscha-bach-dot-md}

<!--list-separator-->

-  <https://youtu.be/K5nJ5l6dl2s?t=443>

<!--list-separator-->

-  information:: discernible differences

<!--list-separator-->

-  state:: set of discernible differences

<!--list-separator-->

-  computation:: description of state changes of a system

<!--list-separator-->

-  digital computation:: discrete states, deterministic or probabilistic rules of change


## [cloud computing]({{< relref "cloud_computing" >}}) {#cloud-computing--cloud-computing-dot-md}


### <span class="org-todo todo TODO">TODO</span> Use pulumi to deploy odoo {#use-pulumi-to-deploy-odoo}


### <span class="org-todo todo TODO">TODO</span> Complete next Kubernetes tutorial (0/6) @est(1h) @low {#complete-next-kubernetes-tutorial--0-6--est--1h--low}


### <span class="org-todo todo TODO">TODO</span> Use Pulumi to deploy zero-to-jupyterhub to gke @est(2h) @low {#use-pulumi-to-deploy-zero-to-jupyterhub-to-gke-est--2h--low}


### <span class="org-todo todo TODO">TODO</span> Complete Pulumi crosswalk gke tutorial @est(2h) @low {#complete-pulumi-crosswalk-gke-tutorial-est--2h--low}


## [bioinformatics]({{< relref "bioinformatics" >}}) {#bioinformatics--bioinformatics-dot-md}


### ☐ See process diagram in (2019). [SEQprocess](https://github.com/omicsCore/SEQprocess/blob/master/vignette/vignettes.pdf): a modularized and customizable pipeline framework for NGS processing in R package. {#see-process-diagram-in--2019--dot-seqprocess-a-modularized-and-customizable-pipeline-framework-for-ngs-processing-in-r-package-dot}


### GATK tutorials: {#gatk-tutorials}

<!--list-separator-->

-  germline @est(30m)

<!--list-separator-->

-  somatic @est(1h)


## [computer algebra]({{< relref "computer_algebra" >}}) {#computer-algebra--computer-algebra-dot-md}


## Tools {#tools}


### [reveal-md](https://github.com/webpro/reveal-md) for converting markdown files to reveal.js / revealjs slideshows {#reveal-md-for-converting-markdown-files-to-reveal-dot-js-revealjs-slideshows}
